# InSup4 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..InSup4 Property
SymbolTypeId Class See Also
---
Symbol in⁴, indicating unit Inches to the fourth power.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId InSup4 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InSup4 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InSup4 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace